tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18313_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F18313_H_
#define _PIC16F18313_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PIR0                          35
#define INTF                          36
#define IOCIF                         37
#define TMR0IF                        38
#define PIR1                          39
#define TMR1IF                        40
#define TMR2IF                        41
#define BCL1IF                        42
#define SSP1IF                        43
#define TXIF                          44
#define RCIF                          45
#define ADIF                          46
#define TMR1GIF                       47
#define PIR2                          48
#define NCO1IF                        49
#define NVMIF                         50
#define C1IF                          51
#define PIR3                          52
#define CLC1IF                        53
#define CLC2IF                        54
#define CSWIF                         55
#define OSFIF                         56
#define PIR4                          57
#define CCP1IF                        58
#define CCP2IF                        59
#define CWG1IF                        60
#define TMR00                         61
#define TMR0L                         62
#define TMR01                         63
#define TMR02                         64
#define TMR03                         65
#define TMR04                         66
#define TMR05                         67
#define TMR06                         68
#define TMR07                         69
#define TMR08                         70
#define TMR0H                         71
#define TMR09                         72
#define TMR010                        73
#define TMR011                        74
#define TMR012                        75
#define TMR013                        76
#define TMR014                        77
#define TMR015                        78
#define T0CON0                        79
#define T0OUTPS                       80
#define T0OUTPS0                      81
#define T0OUTPS1                      82
#define T0OUTPS2                      83
#define T0OUTPS3                      84
#define T016BIT                       85
#define T0OUT                         86
#define T0EN                          87
#define T0CON1                        88
#define T0CKPS                        89
#define T0CKPS0                       90
#define T0CKPS1                       91
#define T0CKPS2                       92
#define T0CKPS3                       93
#define T0ASYNC                       94
#define T0CS                          95
#define T0CS0                         96
#define T0CS1                         97
#define T0CS2                         98
#define TMR1L                         99
#define TMR1H                         100
#define T1CON                         101
#define TMR1ON                        102
#define T1SYNC                        103
#define T1SOSC                        104
#define T1CKPS0                       105
#define T1CKPS                        106
#define T1CKPS1                       107
#define TMR1CS0                       108
#define TMR1CS                        109
#define TMR1CS1                       110
#define T1GCON                        111
#define T1GSS0                        112
#define T1GSS                         113
#define T1GSS1                        114
#define T1GVAL                        115
#define T1GGO_nDONE                   116
#define T1GSPM                        117
#define T1GTM                         118
#define T1GPOL                        119
#define TMR1GE                        120
#define TMR2                          121
#define PR2                           122
#define T2CON                         123
#define T2CKPS0                       124
#define T2CKPS                        125
#define T2CKPS1                       126
#define TMR2ON                        127
#define T2OUTPS0                      128
#define T2OUTPS                       129
#define T2OUTPS1                      130
#define T2OUTPS2                      131
#define T2OUTPS3                      132
#define TRISA                         133
#define TRISA0                        134
#define TRISA1                        135
#define TRISA2                        136
#define TRISA4                        137
#define TRISA5                        138
#define PIE0                          139
#define INTE                          140
#define IOCIE                         141
#define TMR0IE                        142
#define PIE1                          143
#define TMR1IE                        144
#define TMR2IE                        145
#define BCL1IE                        146
#define SSP1IE                        147
#define TXIE                          148
#define RCIE                          149
#define ADIE                          150
#define TMR1GIE                       151
#define PIE2                          152
#define NCO1IE                        153
#define NVMIE                         154
#define C1IE                          155
#define PIE3                          156
#define CLC1IE                        157
#define CLC2IE                        158
#define CSWIE                         159
#define OSFIE                         160
#define PIE4                          161
#define CCP1IE                        162
#define CCP2IE                        163
#define CWG1IE                        164
#define WDTCON                        165
#define SWDTEN                        166
#define WDTPS                         167
#define WDTPS0                        168
#define WDTPS1                        169
#define WDTPS2                        170
#define WDTPS3                        171
#define WDTPS4                        172
#define ADRESL                        173
#define ADRESH                        174
#define ADCON0                        175
#define ADON                          176
#define GO_nDONE                      177
#define GO                            178
#define ADGO                          179
#define CHS0                          180
#define CHS                           181
#define CHS1                          182
#define CHS2                          183
#define CHS3                          184
#define CHS4                          185
#define CHS5                          186
#define ADCON1                        187
#define ADPREF0                       188
#define ADPREF                        189
#define ADPREF1                       190
#define ADNREF                        191
#define ADCS0                         192
#define ADCS                          193
#define ADCS1                         194
#define ADCS2                         195
#define ADFM                          196
#define ADACT                         197
#define ADACT0                        198
#define ADACT1                        199
#define ADACT2                        200
#define ADACT3                        201
#define LATA                          202
#define LATA0                         203
#define LATA1                         204
#define LATA2                         205
#define LATA4                         206
#define LATA5                         207
#define CM1CON0                       208
#define C1SYNC                        209
#define C1HYS                         210
#define C1SP                          211
#define C1POL                         212
#define C1OUT                         213
#define C1ON                          214
#define CM1CON1                       215
#define C1NCH0                        216
#define C1NCH                         217
#define C1NCH1                        218
#define C1NCH2                        219
#define C1PCH                         220
#define C1PCH0                        221
#define C1PCH1                        222
#define C1PCH2                        223
#define C1INTN                        224
#define C1INTP                        225
#define CMOUT                         226
#define MC1OUT                        227
#define BORCON                        228
#define BORRDY                        229
#define SBOREN                        230
#define FVRCON                        231
#define ADFVR0                        232
#define ADFVR                         233
#define ADFVR1                        234
#define CDAFVR                        235
#define CDAFVR0                       236
#define CDAFVR1                       237
#define TSRNG                         238
#define TSEN                          239
#define FVRRDY                        240
#define FVREN                         241
#define DACCON0                       242
#define DAC1NSS                       243
#define DAC1PSS                       244
#define DAC1PSS0                      245
#define DAC1PSS1                      246
#define DAC1OE                        247
#define DAC1EN                        248
#define DACCON1                       249
#define DAC1R                         250
#define DAC1R0                        251
#define DAC1R1                        252
#define DAC1R2                        253
#define DAC1R3                        254
#define DAC1R4                        255
#define ANSELA                        256
#define ANSA0                         257
#define ANSA1                         258
#define ANSA2                         259
#define ANSA4                         260
#define ANSA5                         261
#define VREGCON                       262
#define VREGPM                        263
#define RC1REG                        264
#define TX1REG                        265
#define SP1BRGL                       266
#define SP1BRGH                       267
#define RC1STA                        268
#define RX9D                          269
#define OERR                          270
#define FERR                          271
#define ADDEN                         272
#define CREN                          273
#define SREN                          274
#define RX9                           275
#define SPEN                          276
#define TX1STA                        277
#define TX9D                          278
#define TRMT                          279
#define BRGH                          280
#define SENDB                         281
#define SYNC                          282
#define TXEN                          283
#define TX9                           284
#define CSRC                          285
#define BAUD1CON                      286
#define ABDEN                         287
#define WUE                           288
#define BRG16                         289
#define SCKP                          290
#define RCIDL                         291
#define ABDOVF                        292
#define WPUA                          293
#define WPUA0                         294
#define WPUA1                         295
#define WPUA2                         296
#define WPUA3                         297
#define WPUA4                         298
#define WPUA5                         299
#define SSP1BUF                       300
#define BUF                           301
#define BUF0                          302
#define SSP1BUF0                      303
#define BUF1                          304
#define SSP1BUF1                      305
#define BUF2                          306
#define SSP1BUF2                      307
#define BUF3                          308
#define SSP1BUF3                      309
#define BUF4                          310
#define SSP1BUF4                      311
#define BUF5                          312
#define SSP1BUF5                      313
#define BUF6                          314
#define SSP1BUF6                      315
#define BUF7                          316
#define SSP1BUF7                      317
#define ADD0                          318
#define ADD                           319
#define SSP1ADD0                      320
#define SSP1ADD                       321
#define ADD1                          322
#define SSP1ADD1                      323
#define ADD2                          324
#define SSP1ADD2                      325
#define ADD3                          326
#define SSP1ADD3                      327
#define ADD4                          328
#define SSP1ADD4                      329
#define ADD5                          330
#define SSP1ADD5                      331
#define ADD6                          332
#define SSP1ADD6                      333
#define ADD7                          334
#define SSP1ADD7                      335
#define SSP1MSK0                      336
#define SSP1MSK                       337
#define MSK0                          338
#define MSK                           339
#define SSP1MSK1                      340
#define MSK1                          341
#define SSP1MSK2                      342
#define MSK2                          343
#define SSP1MSK3                      344
#define MSK3                          345
#define SSP1MSK4                      346
#define MSK4                          347
#define SSP1MSK5                      348
#define MSK5                          349
#define SSP1MSK6                      350
#define MSK6                          351
#define SSP1MSK7                      352
#define MSK7                          353
#define SSP1STAT                      354
#define BF                            355
#define UA                            356
#define R_nW                          357
#define S                             358
#define P                             359
#define D_nA                          360
#define CKE                           361
#define SMP                           362
#define SSP1CON1                      363
#define SSPM0                         364
#define SSPM                          365
#define SSPM1                         366
#define SSPM2                         367
#define SSPM3                         368
#define CKP                           369
#define SSPEN                         370
#define SSPOV                         371
#define WCOL                          372
#define SSP1CON2                      373
#define SEN                           374
#define RSEN                          375
#define PEN                           376
#define RCEN                          377
#define ACKEN                         378
#define ACKDT                         379
#define ACKSTAT                       380
#define GCEN                          381
#define SSP1CON3                      382
#define DHEN                          383
#define AHEN                          384
#define SBCDE                         385
#define SDAHT                         386
#define BOEN                          387
#define SCIE                          388
#define PCIE                          389
#define ACKTIM                        390
#define ODCONA                        391
#define ODCA0                         392
#define ODCA1                         393
#define ODCA2                         394
#define ODCA4                         395
#define ODCA5                         396
#define CCPR1L                        397
#define CCPR1H                        398
#define CCP1CON                       399
#define CCP1MODE                      400
#define CCP1MODE0                     401
#define CCP1MODE1                     402
#define CCP1MODE2                     403
#define CCP1MODE3                     404
#define CCP1FMT                       405
#define CCP1OUT                       406
#define CCP1EN                        407
#define CCP1CAP                       408
#define CCP1CTS                       409
#define CCP1CTS0                      410
#define CCP1CTS1                      411
#define CCP1CTS2                      412
#define CCPR2L                        413
#define CCPR2H                        414
#define CCP2CON                       415
#define CCP2MODE                      416
#define CCP2MODE0                     417
#define CCP2MODE1                     418
#define CCP2MODE2                     419
#define CCP2MODE3                     420
#define CCP2FMT                       421
#define CCP2OUT                       422
#define CCP2EN                        423
#define CCP2CAP                       424
#define CCP2CTS                       425
#define CCP2CTS0                      426
#define CCP2CTS1                      427
#define CCP2CTS2                      428
#define CCPTMRS                       429
#define C1TSEL                        430
#define C2TSEL                        431
#define SLRCONA                       432
#define SLRA0                         433
#define SLRA1                         434
#define SLRA2                         435
#define SLRA4                         436
#define SLRA5                         437
#define INLVLA                        438
#define INLVLA0                       439
#define INLVLA1                       440
#define INLVLA2                       441
#define INLVLA3                       442
#define INLVLA4                       443
#define INLVLA5                       444
#define IOCAP                         445
#define IOCAP0                        446
#define IOCAP1                        447
#define IOCAP2                        448
#define IOCAP3                        449
#define IOCAP4                        450
#define IOCAP5                        451
#define IOCAN                         452
#define IOCAN0                        453
#define IOCAN1                        454
#define IOCAN2                        455
#define IOCAN3                        456
#define IOCAN4                        457
#define IOCAN5                        458
#define IOCAF                         459
#define IOCAF0                        460
#define IOCAF1                        461
#define IOCAF2                        462
#define IOCAF3                        463
#define IOCAF4                        464
#define IOCAF5                        465
#define CLKRCON                       466
#define CLKRDIV                       467
#define CLKRDIV0                      468
#define CLKRDIV1                      469
#define CLKRDIV2                      470
#define CLKRDC                        471
#define CLKRDC0                       472
#define CLKRDC1                       473
#define CLKREN                        474
#define MDCON                         475
#define MDBIT                         476
#define MDOUT                         477
#define MDOPOL                        478
#define MDEN                          479
#define MDSRC                         480
#define MDMS0                         481
#define MDMS                          482
#define MDMS1                         483
#define MDMS2                         484
#define MDMS3                         485
#define MDCARH                        486
#define MDCH                          487
#define MDCH0                         488
#define MDCH1                         489
#define MDCH2                         490
#define MDCH3                         491
#define MDCHSYNC                      492
#define MDCHPOL                       493
#define MDCARL                        494
#define MDCL0                         495
#define MDCL                          496
#define MDCL1                         497
#define MDCL2                         498
#define MDCL3                         499
#define MDCLSYNC                      500
#define MDCLPOL                       501
#define CCDNA                         502
#define CCDNA0                        503
#define CCDNA1                        504
#define CCDNA2                        505
#define CCDNA4                        506
#define CCDNA5                        507
#define CCDCON                        508
#define CCDS                          509
#define CCDS0                         510
#define CCDS1                         511
#define CCDEN                         512
#define CCDPA                         513
#define CCDPA0                        514
#define CCDPA1                        515
#define CCDPA2                        516
#define CCDPA4                        517
#define CCDPA5                        518
#define NCO1ACCL                      519
#define NCO1ACCL_NCO1ACC              520
#define NCO1ACCH                      521
