tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18313_tdd.h
#define NCO1ACCH_NCO1ACC              522
#define NCO1ACCU                      523
#define NCO1ACCU_NCO1ACC              524
#define NCO1INCL                      525
#define NCO1INCL_NCO1INC              526
#define NCO1INCH                      527
#define NCO1INCH_NCO1INC              528
#define NCO1INCU                      529
#define NCO1INCU_NCO1INC              530
#define NCO1CON                       531
#define N1PFM                         532
#define N1POL                         533
#define N1OUT                         534
#define N1EN                          535
#define NCO1CLK                       536
#define N1CKS                         537
#define N1PWS                         538
#define PWM5DCL                       539
#define PWM5DCL0                      540
#define PWM5DCL1                      541
#define PWM5DCH                       542
#define PWM5DCH0                      543
#define PWM5DCH1                      544
#define PWM5DCH2                      545
#define PWM5DCH3                      546
#define PWM5DCH4                      547
#define PWM5DCH5                      548
#define PWM5DCH6                      549
#define PWM5DCH7                      550
#define PWM5CON                       551
#define PWM5POL                       552
#define PWM5OUT                       553
#define PWM5EN                        554
#define PWM6DCL                       555
#define PWM6DCL0                      556
#define PWM6DCL1                      557
#define PWM6DCH                       558
#define PWM6DCH0                      559
#define PWM6DCH1                      560
#define PWM6DCH2                      561
#define PWM6DCH3                      562
#define PWM6DCH4                      563
#define PWM6DCH5                      564
#define PWM6DCH6                      565
#define PWM6DCH7                      566
#define PWM6CON                       567
#define PWM6POL                       568
#define PWM6OUT                       569
#define PWM6EN                        570
#define CWG1CLKCON                    571
#define CS                            572
#define CWG1CS                        573
#define CWG1DAT                       574
#define DAT                           575
#define CWG1DAT0                      576
#define CWG1DAT1                      577
#define CWG1DAT2                      578
#define CWG1DAT3                      579
#define CWG1DBR0                      580
#define CWG1DBR                       581
#define DBR                           582
#define DBR0                          583
#define CWG1DBR1                      584
#define DBR1                          585
#define CWG1DBR2                      586
#define DBR2                          587
#define CWG1DBR3                      588
#define DBR3                          589
#define CWG1DBR4                      590
#define DBR4                          591
#define CWG1DBR5                      592
#define DBR5                          593
#define CWG1DBF                       594
#define CWG1DBF0                      595
#define DBF                           596
#define DBF0                          597
#define CWG1DBF1                      598
#define DBF1                          599
#define CWG1DBF2                      600
#define DBF2                          601
#define CWG1DBF3                      602
#define DBF3                          603
#define CWG1DBF4                      604
#define DBF4                          605
#define DBF5                          606
#define CWG1DBF5                      607
#define CWG1CON0                      608
#define CWG1MODE0                     609
#define CWG1CON0_MODE                 610
#define CWG1CON0_MODE0                611
#define CWG1MODE                      612
#define CWG1MODE1                     613
#define CWG1CON0_MODE1                614
#define CWG1MODE2                     615
#define CWG1CON0_MODE2                616
#define LD                            617
#define CWG1LD                        618
#define CWG1EN                        619
#define G1EN                          620
#define CWG1CON0_EN                   621
#define CWG1CON1                      622
#define CWG1POLA                      623
#define POLA                          624
#define CWG1POLB                      625
#define POLB                          626
#define CWG1POLC                      627
#define POLC                          628
#define CWG1POLD                      629
#define POLD                          630
#define IN                            631
#define CWG1IN                        632
#define CWG1AS0                       633
#define CWG1LSAC                      634
#define LSAC                          635
#define LSAC0                         636
#define CWG1LSAC0                     637
#define LSAC1                         638
#define CWG1LSAC1                     639
#define LSBD0                         640
#define CWG1LSBD0                     641
#define LSBD                          642
#define CWG1LSBD                      643
#define LSBD1                         644
#define CWG1LSBD1                     645
#define CWG1REN                       646
#define REN                           647
#define CWG1SHUTDOWN                  648
#define SHUTDOWN                      649
#define CWG1AS1                       650
#define AS0E                          651
#define AS1E                          652
#define AS3E                          653
#define CWG1STR                       654
#define CWG1STRA                      655
#define STRA                          656
#define STRB                          657
#define CWG1STRB                      658
#define CWG1STRC                      659
#define STRC                          660
#define CWG1STRD                      661
#define STRD                          662
#define OVRA                          663
#define CWG1OVRA                      664
#define CWG1OVRB                      665
#define OVRB                          666
#define OVRC                          667
#define CWG1OVRC                      668
#define OVRD                          669
#define CWG1OVRD                      670
#define NVMADR0                       671
#define NVMADRL                       672
#define NVMADR1                       673
#define NVMADR2                       674
#define NVMADR3                       675
#define NVMADR4                       676
#define NVMADR5                       677
#define NVMADR6                       678
#define NVMADR7                       679
#define NVMADR8                       680
#define NVMADRH                       681
#define NVMADR9                       682
#define NVMADR10                      683
#define NVMADR11                      684
#define NVMADR12                      685
#define NVMADR13                      686
#define NVMADR14                      687
#define NVMDAT0                       688
#define NVMDATL                       689
#define NVMDAT1                       690
#define NVMDAT2                       691
#define NVMDAT3                       692
#define NVMDAT4                       693
#define NVMDAT5                       694
#define NVMDAT6                       695
#define NVMDAT7                       696
#define NVMDAT8                       697
#define NVMDATH                       698
#define NVMDAT9                       699
#define NVMDAT10                      700
#define NVMDAT11                      701
#define NVMDAT12                      702
#define NVMDAT13                      703
#define NVMCON1                       704
#define RD                            705
#define WR                            706
#define WREN                          707
#define WRERR                         708
#define FREE                          709
#define LWLO                          710
#define NVMREGS                       711
#define NVMCON2                       712
#define NMVCON2                       713
#define PCON0                         714
#define nBOR                          715
#define nPOR                          716
#define nRI                           717
#define nRMCLR                        718
#define nRWDT                         719
#define STKUNF                        720
#define STKOVF                        721
#define PMD0                          722
#define IOCMD                         723
#define CLKRMD                        724
#define NVMMD                         725
#define FVRMD                         726
#define SYSCMD                        727
#define PMD1                          728
#define TMR0MD                        729
#define TMR1MD                        730
#define TMR2MD                        731
#define NCOMD                         732
#define PMD2                          733
#define CMP1MD                        734
#define ADCMD                         735
#define DACMD                         736
#define PMD3                          737
#define CCP1MD                        738
#define CCP2MD                        739
#define PWM5MD                        740
#define PWM6MD                        741
#define CWG1MD                        742
#define PMD4                          743
#define MSSP1MD                       744
#define UART1MD                       745
#define PMD5                          746
#define DSMMD                         747
#define CLC1MD                        748
#define CLC2MD                        749
#define CPUDOZE                       750
#define DOZE0                         751
#define DOZE                          752
#define DOZE1                         753
#define DOZE2                         754
#define DOE                           755
#define ROI                           756
#define DOZEN                         757
#define IDLEN                         758
#define OSCCON1                       759
#define NDIV0                         760
#define NDIV                          761
#define NDIV1                         762
#define NDIV2                         763
#define NDIV3                         764
#define NOSC0                         765
#define NOSC                          766
#define NOSC1                         767
#define NOSC2                         768
#define OSCCON2                       769
#define CDIV0                         770
#define CDIV                          771
#define CDIV1                         772
#define CDIV2                         773
#define CDIV3                         774
#define COSC                          775
#define COSC0                         776
#define COSC1                         777
#define COSC2                         778
#define OSCCON3                       779
#define NOSCR                         780
#define ORDY                          781
#define SOSCBE                        782
#define SOSCPWR                       783
#define CSWHOLD                       784
#define OSCSTAT1                      785
#define PLLR                          786
#define ADOR                          787
#define SOR                           788
#define LFOR                          789
#define HFOR                          790
#define EXTOR                         791
#define OSCEN                         792
#define ADOEN                         793
#define SOSCEN                        794
#define LFOEN                         795
#define HFOEN                         796
#define EXTOEN                        797
#define OSCTUNE                       798
#define HFTUN0                        799
#define HFTUN                         800
#define HFTUN1                        801
#define HFTUN2                        802
#define HFTUN3                        803
#define HFTUN4                        804
#define HFTUN5                        805
#define OSCFRQ                        806
#define HFFRQ                         807
#define HFFRQ0                        808
#define HFFRQ1                        809
#define HFFRQ2                        810
#define HFFRQ3                        811
#define PPSLOCK                       812
#define PPSLOCKED                     813
#define INTPPS0                       814
#define INTPPS                        815
#define INTPPS1                       816
#define INTPPS2                       817
#define INTPPS3                       818
#define INTPPS4                       819
#define T0CKIPPS0                     820
#define T0CKIPPS                      821
#define T0CKIPPS1                     822
#define T0CKIPPS2                     823
#define T0CKIPPS3                     824
#define T0CKIPPS4                     825
#define T1CKIPPS0                     826
#define T1CKIPPS                      827
#define T1CKIPPS1                     828
#define T1CKIPPS2                     829
#define T1CKIPPS3                     830
#define T1CKIPPS4                     831
#define T1GPPS0                       832
#define T1GPPS                        833
#define T1GPPS1                       834
#define T1GPPS2                       835
#define T1GPPS3                       836
#define T1GPPS4                       837
#define CCP1PPS0                      838
#define CCP1PPS                       839
#define CCP1PPS1                      840
#define CCP1PPS2                      841
#define CCP1PPS3                      842
#define CCP1PPS4                      843
#define CCP2PPS0                      844
#define CCP2PPS                       845
#define CCP2PPS1                      846
#define CCP2PPS2                      847
#define CCP2PPS3                      848
#define CCP2PPS4                      849
#define CWG1PPS0                      850
#define CWG1PPS                       851
#define CWG1PPS1                      852
#define CWG1PPS2                      853
#define CWG1PPS3                      854
#define CWG1PPS4                      855
#define MDCIN1PPS                     856
#define MDCIN1PPS0                    857
#define MDCIN1PPS1                    858
#define MDCIN1PPS2                    859
#define MDCIN1PPS3                    860
#define MDCIN1PPS4                    861
#define MDCIN2PPS0                    862
#define MDCIN2PPS                     863
#define MDCIN2PPS1                    864
#define MDCIN2PPS2                    865
#define MDCIN2PPS3                    866
#define MDCIN2PPS4                    867
#define MDMINPPS                      868
#define MDMINPPS0                     869
#define MDMINPPS1                     870
#define MDMINPPS2                     871
#define MDMINPPS3                     872
#define MDMINPPS4                     873
#define SSP1CLKPPS0                   874
#define SSP1CLKPPS                    875
#define SSP1CLKPPS1                   876
#define SSP1CLKPPS2                   877
#define SSP1CLKPPS3                   878
#define SSP1CLKPPS4                   879
#define SSP1DATPPS0                   880
#define SSP1DATPPS                    881
#define SSP1DATPPS1                   882
#define SSP1DATPPS2                   883
#define SSP1DATPPS3                   884
#define SSP1DATPPS4                   885
#define SSP1SSPPS                     886
#define SSP1SSPPS0                    887
#define SSP1SSPPS1                    888
#define SSP1SSPPS2                    889
#define SSP1SSPPS3                    890
#define SSP1SSPPS4                    891
#define RXPPS0                        892
#define RXPPS                         893
#define RXPPS1                        894
#define RXPPS2                        895
#define RXPPS3                        896
#define RXPPS4                        897
#define TXPPS0                        898
#define TXPPS                         899
#define TXPPS1                        900
#define TXPPS2                        901
#define TXPPS3                        902
#define TXPPS4                        903
#define CLCIN0PPS                     904
#define CLCIN0PPS0                    905
#define CLCIN0PPS1                    906
#define CLCIN0PPS2                    907
#define CLCIN0PPS3                    908
#define CLCIN0PPS4                    909
#define CLCIN1PPS0                    910
#define CLCIN1PPS                     911
#define CLCIN1PPS1                    912
#define CLCIN1PPS2                    913
#define CLCIN1PPS3                    914
#define CLCIN1PPS4                    915
#define CLCIN2PPS                     916
#define CLCIN2PPS0                    917
#define CLCIN2PPS1                    918
#define CLCIN2PPS2                    919
#define CLCIN2PPS3                    920
#define CLCIN2PPS4                    921
#define CLCIN3PPS                     922
#define CLCIN3PPS0                    923
#define CLCIN3PPS1                    924
#define CLCIN3PPS2                    925
#define CLCIN3PPS3                    926
#define CLCIN3PPS4                    927
#define RA0PPS                        928
#define RA0PPS0                       929
#define RA0PPS1                       930
#define RA0PPS2                       931
#define RA0PPS3                       932
#define RA0PPS4                       933
#define RA1PPS                        934
#define RA1PPS0                       935
#define RA1PPS1                       936
#define RA1PPS2                       937
#define RA1PPS3                       938
#define RA1PPS4                       939
#define RA2PPS0                       940
#define RA2PPS                        941
#define RA2PPS1                       942
#define RA2PPS2                       943
#define RA2PPS3                       944
#define RA2PPS4                       945
#define RA4PPS                        946
#define RA4PPS0                       947
#define RA4PPS1                       948
#define RA4PPS2                       949
#define RA4PPS3                       950
#define RA4PPS4                       951
#define RA5PPS                        952
#define RA5PPS0                       953
#define RA5PPS1                       954
#define RA5PPS2                       955
#define RA5PPS3                       956
#define RA5PPS4                       957
#define CLCDATA                       958
#define MLC1OUT                       959
#define MLC2OUT                       960
#define CLC1CON                       961
#define CLC1CON_MODE0                 962
#define LC1MODE                       963
#define CLC1CON_MODE                  964
#define LC1MODE0                      965
#define CLC1CON_MODE1                 966
#define LC1MODE1                      967
#define LC1MODE2                      968
#define CLC1CON_MODE2                 969
#define LC1INTN                       970
#define CLC1CON_INTN                  971
#define CLC1CON_INTP                  972
#define LC1INTP                       973
#define LC1OUT                        974
#define CLC1CON_OUT                   975
#define CLC1CON_EN                    976
#define LC1EN                         977
#define CLC1POL                       978
#define LC1G1POL                      979
#define CLC1POL_G1POL                 980
#define CLC1POL_G2POL                 981
#define LC1G2POL                      982
#define LC1G3POL                      983
#define CLC1POL_G3POL                 984
#define LC1G4POL                      985
#define CLC1POL_G4POL                 986
#define CLC1POL_POL                   987
#define LC1POL                        988
#define CLC1SEL0                      989
#define CLC1SEL0_D1S0                 990
#define LC1D1S                        991
#define LC1D1S0                       992
#define CLC1SEL0_D1S                  993
#define CLC1SEL0_D1S1                 994
#define LC1D1S1                       995
#define CLC1SEL0_D1S2                 996
#define LC1D1S2                       997
#define CLC1SEL0_D1S3                 998
#define LC1D1S3                       999
#define CLC1SEL0_D1S4                 1000
#define LC1D1S4                       1001
#define CLC1SEL1                      1002
#define CLC1SEL1_D2S0                 1003
#define CLC1SEL1_D2S                  1004
#define LC1D2S                        1005
#define LC1D2S0                       1006
#define CLC1SEL1_D2S1                 1007
#define LC1D2S1                       1008
#define LC1D2S2                       1009
#define CLC1SEL1_D2S2                 1010
#define LC1D2S3                       1011
#define CLC1SEL1_D2S3                 1012
#define LC1D2S4                       1013
#define CLC1SEL1_D2S4                 1014
#define CLC1SEL2                      1015
#define LC1D3S0                       1016
#define CLC1SEL2_D3S                  1017
#define LC1D3S                        1018
#define CLC1SEL2_D3S0                 1019
#define LC1D3S1                       1020
#define CLC1SEL2_D3S1                 1021
#define LC1D3S2                       1022
#define CLC1SEL2_D3S2                 1023
#define LC1D3S3                       1024
#define CLC1SEL2_D3S3                 1025
#define LC1D3S4                       1026
#define CLC1SEL2_D3S4                 1027
#define CLC1SEL3                      1028
#define CLC1SEL3_D4S                  1029
#define LC1D4S                        1030
#define LC1D4S0                       1031
#define CLC1SEL3_D4S0                 1032
#define CLC1SEL3_D4S1                 1033
#define LC1D4S1                       1034
#define LC1D4S2                       1035
#define CLC1SEL3_D4S2                 1036
#define LC1D4S3                       1037
#define CLC1SEL3_D4S3                 1038
#define LC1D4S4                       1039
#define CLC1SEL3_D4S4                 1040
#define CLC1GLS0                      1041
#define CLC1GLS0_D1N                  1042
#define LC1G1D1N                      1043
#define CLC1GLS0_D1T                  1044
#define LC1G1D1T                      1045
#define LC1G1D2N                      1046
#define CLC1GLS0_D2N                  1047
#define LC1G1D2T                      1048
#define CLC1GLS0_D2T                  1049
#define CLC1GLS0_D3N                  1050
#define LC1G1D3N                      1051
#define CLC1GLS0_D3T                  1052
#define LC1G1D3T                      1053
#define CLC1GLS0_D4N                  1054
#define LC1G1D4N                      1055
#define CLC1GLS0_D4T                  1056
#define LC1G1D4T                      1057
#define CLC1GLS1                      1058
#define CLC1GLS1_D1N                  1059
#define LC1G2D1N                      1060
#define LC1G2D1T                      1061
#define CLC1GLS1_D1T                  1062
#define CLC1GLS1_D2N                  1063
#define LC1G2D2N                      1064
#define LC1G2D2T                      1065
#define CLC1GLS1_D2T                  1066
#define CLC1GLS1_D3N                  1067
#define LC1G2D3N                      1068
#define LC1G2D3T                      1069
#define CLC1GLS1_D3T                  1070
#define CLC1GLS1_D4N                  1071
#define LC1G2D4N                      1072
#define LC1G2D4T                      1073
#define CLC1GLS1_D4T                  1074
#define CLC1GLS2                      1075
#define CLC1GLS2_D1N                  1076
#define LC1G3D1N                      1077
#define LC1G3D1T                      1078
#define CLC1GLS2_D1T                  1079
#define LC1G3D2N                      1080
#define CLC1GLS2_D2N                  1081
#define LC1G3D2T                      1082
#define CLC1GLS2_D2T                  1083
#define CLC1GLS2_D3N                  1084
#define LC1G3D3N                      1085
#define LC1G3D3T                      1086
#define CLC1GLS2_D3T                  1087
#define LC1G3D4N                      1088
#define CLC1GLS2_D4N                  1089
#define LC1G3D4T                      1090
