tiborsimon/embedded-tdd-headers/pic/pic16/pic16f18313_tdd.h
#define CLC1GLS2_D4T                  1091
#define CLC1GLS3                      1092
#define LC1G4D1N                      1093
#define CLC1GLS3_G4D1N                1094
#define LC1G4D1T                      1095
#define CLC1GLS3_G4D1T                1096
#define CLC1GLS3_G4D2N                1097
#define LC1G4D2N                      1098
#define CLC1GLS3_G4D2T                1099
#define LC1G4D2T                      1100
#define LC1G4D3N                      1101
#define CLC1GLS3_G4D3N                1102
#define LC1G4D3T                      1103
#define CLC1GLS3_G4D3T                1104
#define CLC1GLS3_G4D4N                1105
#define LC1G4D4N                      1106
#define CLC1GLS3_G4D4T                1107
#define LC1G4D4T                      1108
#define CLC2CON                       1109
#define LC2MODE0                      1110
#define CLC2CON_MODE                  1111
#define LC2MODE                       1112
#define CLC2CON_MODE0                 1113
#define LC2MODE1                      1114
#define CLC2CON_MODE1                 1115
#define LC2MODE2                      1116
#define CLC2CON_MODE2                 1117
#define LC2INTN                       1118
#define CLC2CON_INTN                  1119
#define LC2INTP                       1120
#define CLC2CON_INTP                  1121
#define CLC2CON_OUT                   1122
#define LC2OUT                        1123
#define CLC2CON_EN                    1124
#define LC2EN                         1125
#define CLC2POL                       1126
#define LC2G1POL                      1127
#define CLC2POL_G1POL                 1128
#define LC2G2POL                      1129
#define CLC2POL_G2POL                 1130
#define LC2G3POL                      1131
#define CLC2POL_G3POL                 1132
#define LC2G4POL                      1133
#define CLC2POL_G4POL                 1134
#define CLC2POL_POL                   1135
#define LC2POL                        1136
#define CLC2SEL0                      1137
#define CLC2SEL0_D1S                  1138
#define LC2D1S0                       1139
#define CLC2SEL0_D1S0                 1140
#define LC2D1S                        1141
#define LC2D1S1                       1142
#define CLC2SEL0_D1S1                 1143
#define LC2D1S2                       1144
#define CLC2SEL0_D1S2                 1145
#define CLC2SEL0_D1S3                 1146
#define LC2D1S3                       1147
#define LC2D1S4                       1148
#define CLC2SEL0_D1S4                 1149
#define CLC2SEL1                      1150
#define LC2D2S0                       1151
#define CLC2SEL1_D2S0                 1152
#define LC2D2S                        1153
#define CLC2SEL1_D2S                  1154
#define LC2D2S1                       1155
#define CLC2SEL1_D2S1                 1156
#define LC2D2S2                       1157
#define CLC2SEL1_D2S2                 1158
#define LC2D2S3                       1159
#define CLC2SEL1_D2S3                 1160
#define LC2D2S4                       1161
#define CLC2SEL1_D2S4                 1162
#define CLC2SEL2                      1163
#define CLC2SEL2_D3S                  1164
#define LC2D3S0                       1165
#define CLC2SEL2_D3S0                 1166
#define LC2D3S                        1167
#define CLC2SEL2_D3S1                 1168
#define LC2D3S1                       1169
#define LC2D3S2                       1170
#define CLC2SEL2_D3S2                 1171
#define LC2D3S3                       1172
#define CLC2SEL2_D3S3                 1173
#define LC2D3S4                       1174
#define CLC2SEL2_D3S4                 1175
#define CLC2SEL3                      1176
#define LC2D4S                        1177
#define LC2D4S0                       1178
#define CLC2SEL3_D4S                  1179
#define CLC2SEL3_D4S0                 1180
#define LC2D4S1                       1181
#define CLC2SEL3_D4S1                 1182
#define LC2D4S2                       1183
#define CLC2SEL3_D4S2                 1184
#define CLC2SEL3_D4S3                 1185
#define LC2D4S3                       1186
#define LC2D4S4                       1187
#define CLC2SEL3_D4S4                 1188
#define CLC2GLS0                      1189
#define LC2G1D1N                      1190
#define CLC2GLS0_D1N                  1191
#define CLC2GLS0_D1T                  1192
#define LC2G1D1T                      1193
#define LC2G1D2N                      1194
#define CLC2GLS0_D2N                  1195
#define CLC2GLS0_D2T                  1196
#define LC2G1D2T                      1197
#define LC2G1D3N                      1198
#define CLC2GLS0_D3N                  1199
#define CLC2GLS0_D3T                  1200
#define LC2G1D3T                      1201
#define LC2G1D4N                      1202
#define CLC2GLS0_D4N                  1203
#define CLC2GLS0_D4T                  1204
#define LC2G1D4T                      1205
#define CLC2GLS1                      1206
#define CLC2GLS1_D1N                  1207
#define LC2G2D1N                      1208
#define CLC2GLS1_D1T                  1209
#define LC2G2D1T                      1210
#define CLC2GLS1_D2N                  1211
#define LC2G2D2N                      1212
#define CLC2GLS1_D2T                  1213
#define LC2G2D2T                      1214
#define LC2G2D3N                      1215
#define CLC2GLS1_D3N                  1216
#define LC2G2D3T                      1217
#define CLC2GLS1_D3T                  1218
#define LC2G2D4N                      1219
#define CLC2GLS1_D4N                  1220
#define LC2G2D4T                      1221
#define CLC2GLS1_D4T                  1222
#define CLC2GLS2                      1223
#define LC2G3D1N                      1224
#define CLC2GLS2_D1N                  1225
#define CLC2GLS2_D1T                  1226
#define LC2G3D1T                      1227
#define CLC2GLS2_D2N                  1228
#define LC2G3D2N                      1229
#define LC2G3D2T                      1230
#define CLC2GLS2_D2T                  1231
#define CLC2GLS2_D3N                  1232
#define LC2G3D3N                      1233
#define CLC2GLS2_D3T                  1234
#define LC2G3D3T                      1235
#define CLC2GLS2_D4N                  1236
#define LC2G3D4N                      1237
#define LC2G3D4T                      1238
#define CLC2GLS2_D4T                  1239
#define CLC2GLS3                      1240
#define LC2G4D1N                      1241
#define CLC2GLS3_G4D1N                1242
#define CLC2GLS3_G4D1T                1243
#define LC2G4D1T                      1244
#define CLC2GLS3_G4D2N                1245
#define LC2G4D2N                      1246
#define LC2G4D2T                      1247
#define CLC2GLS3_G4D2T                1248
#define CLC2GLS3_G4D3N                1249
#define LC2G4D3N                      1250
#define CLC2GLS3_G4D3T                1251
#define LC2G4D3T                      1252
#define LC2G4D4N                      1253
#define CLC2GLS3_G4D4N                1254
#define CLC2GLS3_G4D4T                1255
#define LC2G4D4T                      1256
#define STATUS_SHAD                   1257
#define C_SHAD                        1258
#define DC_SHAD                       1259
#define Z_SHAD                        1260
#define WREG_SHAD                     1261
#define BSR_SHAD                      1262
#define PCLATH_SHAD                   1263
#define FSR0L_SHAD                    1264
#define FSR0H_SHAD                    1265
#define FSR1L_SHAD                    1266
#define FSR1H_SHAD                    1267
#define STKPTR                        1268
#define TOSL                          1269
#define TOSH                          1270

#endif // _PIC16F18313_H_
